src/cf/Documents/вогТранспортныеЗатраты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Document>
		<Properties>
			<Name>вогТранспортныеЗатраты</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.вогТранспортныеЗатраты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СценарийПланирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогСценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияСценария</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогВерсииСценариевПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаТранспортныхЗатрат</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Клиент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CRM_СтатьиЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТранспортныеЗатраты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Documents/вогТранспортныеЗатраты/Forms/ФормаЗагрузкиДанные/Ext/Form/Module.bsl
&НаСервере
Функция ЗагрузитьДанныеНаСервере()
	
	Если пропуститьПервуюСтроку тогда
		Проверка = ТабДок.Область(2,1,2,1);
		НомерСтроки=2;
	Иначе
		Проверка = ТабДок.Область(1,1,1,1);
		НомерСтроки=1;
	КонецЕсли;
	ТаблицаДанных.Очистить();
	Пока Проверка.Текст<>"" цикл
		
		//1 - Филиал
		//2 - Клиент
		//3 - Статья затрат
		//4 - Транспортные затраты
		//5 - Клиент (GUID)
		ФилиалСтрока = СокрЛП(ТабДок.Область(НомерСтроки,1,НомерСтроки,1).Текст);
		КлиентСтрока = СокрЛП(ТабДок.Область(НомерСтроки,2,НомерСтроки,2).Текст);
		СтатьяЗатратСтрока = СокрЛП(ТабДок.Область(НомерСтроки,3,НомерСтроки,3).Текст);
		КлиентИД = СокрЛП(ТабДок.Область(НомерСтроки,5,НомерСтроки,5).Текст);
		
		Если нрег(ФилиалСтрока) = "вог сибирь" или нрег(ФилиалСтрока) = "вог-сибирь" тогда
			Филиал = Справочники.СтруктураПредприятия.НайтиПоКоду("000000009");		
		ИначеЕсли нрег(ФилиалСтрока) = "вог урал" или нрег(ФилиалСтрока) = "вог-урал" тогда
			Филиал = Справочники.СтруктураПредприятия.НайтиПоКоду("000000003");		
		ИначеЕсли нрег(ФилиалСтрока) = "вог самара" или нрег(ФилиалСтрока) = "вог-самара" тогда
			Филиал = Справочники.СтруктураПредприятия.НайтиПоКоду("000000008");		
		ИначеЕсли нрег(ФилиалСтрока) = "вог юг - ростов" или нрег(ФилиалСтрока) = "вог-юг-ростов" или нрег(ФилиалСтрока) = "вог юг ростов" тогда
			Филиал = Справочники.СтруктураПредприятия.НайтиПоКоду("CR-000015");		
		ИначеЕсли нрег(ФилиалСтрока) = "вог юг - кмв" или нрег(ФилиалСтрока) = "вог-юг-кмв" или нрег(ФилиалСтрока) = "вог юг кмв" тогда
			Филиал = Справочники.СтруктураПредприятия.НайтиПоКоду("000000004");		
		ИначеЕсли нрег(ФилиалСтрока) = "вог кубань" или нрег(ФилиалСтрока) = "вог-кубань" тогда
			Филиал = Справочники.СтруктураПредприятия.НайтиПоКоду("000000002");		
		ИначеЕсли нрег(ФилиалСтрока) = "декор-к"  тогда
			Филиал = Справочники.СтруктураПредприятия.НайтиПоКоду("000000013");		
		ИначеЕсли нрег(ФилиалСтрока) = "тк вог" или нрег(ФилиалСтрока) = "тк-вог" тогда
			Филиал = Справочники.СтруктураПредприятия.НайтиПоКоду("000000006");		
		ИначеЕсли нрег(ФилиалСтрока) = "вог керамика" или нрег(ФилиалСтрока) = "вог-керамика" тогда
			Филиал = Справочники.СтруктураПредприятия.НайтиПоКоду("000000001");		
		Иначе
			Филиал = Справочники.СтруктураПредприятия.ПустаяСсылка();
			Сообщить("Ошибка обработки филиала строка "+ НомерСтроки);	
		КонецЕсли;
		
		Если СтатьяЗатратСтрока<>"" тогда
			СтатьяЗатрат = Справочники.CRM_СтатьиЗатрат.НайтиПоНаименованию(СтатьяЗатратСтрока);
		КонецЕсли;                                           
		
		
		Если Не ЗначениеЗаполнено(СтатьяЗатрат) тогда
			Сообщить("Ошибка обработки статьи затрыт строка "+ НомерСтроки);	
		КонецЕсли;
		
		Если ЗначениеЗаполнено(КлиентИД) тогда
			Клиент = Справочники.Партнеры.ПолучитьСсылку(Новый УникальныйИдентификатор(КлиентИД));	
		ИначеЕсли  ЗначениеЗаполнено(КлиентСтрока) тогда
			Клиент = Справочники.Партнеры.НайтиПоНаименованию(КлиентСтрока,Истина);
		Иначе
			Клиент = Справочники.Партнеры.ПустаяСсылка();
		КонецЕсли;
	
		нСтрока = ТаблицаДанных.Добавить();
		нСтрока.Подразделение = Филиал;
		нСтрока.СтатьяЗатрат = СтатьяЗатрат;
		нСтрока.Период = ПериодЗатрат;
		нСтрока.Клиент = Клиент;
		
		Попытка
			ДанныеК = Число(СтрЗаменить(СтрЗаменить(СокрЛП(ТабДок.Область(НомерСтроки,4,НомерСтроки,4).Текст),",",".")," ",""));
		Исключение
		КонецПопытки;
		нСтрока.ТранспортныеЗатраты = ДанныеК;	
		
		НомерСтроки = НомерСтроки + 1;
		Проверка = ТабДок.Область(НомерСтроки,1,НомерСтроки,1);
	КонецЦикла;
		
	АдресВХранилище = ПоместитьВоВременноеХранилище(ТаблицаДанных.Выгрузить(),Новый УникальныйИдентификатор);
	Возврат АдресВХранилище;
	
КонецФункции

&НаКлиенте
Процедура ЗагрузитьДанные(Команда)
	
	АдресХ = ЗагрузитьДанныеНаСервере();
	Закрыть(АдресХ);
	
КонецПроцедуры
